export function getIranProvincesFa(): Promise<Record<string, string[]>> {
	return new Promise((resolve) => {
		setTimeout(() => {
			resolve(iranProvincesFa);
		}, 100);
	});
}
export const iranProvincesFa: Record<string, string[]> = {
	تهران: [
		"تهران",
		"ری",
		"شمیرانات",
		"اسلامشهر",
		"شهریار",
		"رباطکریم",
		"قدس",
		"ورامین",
		"پاکدشت",
		"ملارد",
	],

	البرز: ["کرج", "طالقان", "نظرآباد", "اشتهارد", "فردیس", "ماهدشت"],

	اصفهان: [
		"اصفهان",
		"کاشان",
		"نجفآباد",
		"خمینیشهر",
		"شاهینشهر",
		"مبارکه",
		"فولادشهر",
		"زرینشهر",
		"گلپایگان",
	],

	فارس: [
		"شیراز",
		"مرودشت",
		"جهرم",
		"کازرون",
		"فسا",
		"داراب",
		"لار",
		"لامرد",
		"نیریز",
	],

	"خراسان رضوی": [
		"مشهد",
		"نیشابور",
		"سبزوار",
		"تربت حیدریه",
		"قوچان",
		"چناران",
		"فریمان",
	],

	"آذربایجان شرقی": ["تبریز", "مراغه", "مرند", "اهر", "بناب", "شبستر", "سراب"],

	"آذربایجان غربی": [
		"ارومیه",
		"خوی",
		"مهاباد",
		"میاندوآب",
		"پیرانشهر",
		"سردشت",
	],

	گیلان: ["رشت", "انزلی", "لاهیجان", "آستارا", "رودسر", "فومن", "صومعهسرا"],

	مازندران: ["ساری", "آمل", "بابل", "قائمشهر", "نوشهر", "رامسر", "بهشهر"],

	کرمانشاه: ["کرمانشاه", "اسلامآباد غرب", "جوانرود", "پاوه", "کنگاور", "سنقر"],

	کردستان: ["سنندج", "سقز", "مریوان", "بانه", "بیجار", "قروه"],

	همدان: ["همدان", "ملایر", "نهاوند", "اسدآباد", "تویسرکان"],

	مرکزی: ["اراک", "ساوه", "محلات", "خمین", "دلیجان", "زرندیه"],

	قزوین: ["قزوین", "تاکستان", "آبیک", "بویینزهرا"],

	قم: ["قم"],

	سمنان: ["سمنان", "شاهرود", "دامغان", "گرمسار", "مهدیشهر"],

	گلستان: ["گرگان", "گنبد کاووس", "علیآباد", "بندرگز", "کردکوی"],

	"خراسان شمالی": ["بجنورد", "شیروان", "اسفراین", "آشخانه"],

	"خراسان جنوبی": ["بیرجند", "فردوس", "قاین", "نهبندان"],

	هرمزگان: ["بندرعباس", "قشم", "بندرلنگه", "میناب", "جاسک", "حاجیآباد", "کیش"],

	بوشهر: ["بوشهر", "برازجان", "عسلویه", "کنگان", "گناوه", "دیلم"],

	خوزستان: [
		"اهواز",
		"آبادان",
		"خرمشهر",
		"ماهشهر",
		"دزفول",
		"اندیمشک",
		"شوشتر",
		"رامهرمز",
	],

	لرستان: ["خرمآباد", "بروجرد", "دورود", "کوهدشت", "الشتر"],

	ایلام: ["ایلام", "دهلران", "مهران", "ایوان", "آبدانان"],

	"چهارمحال و بختیاری": ["شهرکرد", "بروجن", "لردگان", "فارسان"],

	"کهگیلویه و بویراحمد": ["یاسوج", "گچساران", "دهدشت", "سیسخت"],

	کرمان: ["کرمان", "رفسنجان", "سیرجان", "بم", "جیرفت", "بافت", "زرند"],

	"سیستان و بلوچستان": [
		"زاهدان",
		"زابل",
		"چابهار",
		"ایرانشهر",
		"سراوان",
		"خاش",
	],

	یزد: ["یزد", "اردکان", "مهریز", "تفت", "ابرکوه"],
};
